In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [3]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [4]:
%%sql

SELECT *
  FROM facts
 LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [5]:
%%sql

SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
  FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

In [10]:
%%sql

SELECT name 
  FROM facts
 WHERE population = 0;

Done.

[('Antarctica',)]

In [11]:
%%sql

SELECT name 
  FROM facts
 WHERE population = 7256490011;

Done.

[('World',)]

In [13]:
%%sql

SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
  FROM facts
 WHERE population < 7256490011;

Done.

[(0, 1367485388, 0.0, 4.02)]

In [16]:
%%sql

SELECT ROUND(AVG(population),0), ROUND(AVG(area),1)
  FROM FACTS
 WHERE population < 7256490011;

Done.

[(32242667.0, 582949.9)]

In [17]:
%%sql

SELECT name
  FROM facts
 WHERE population > (SELECT ROUND(AVG(population),0)
                       FROM FACTS
                      WHERE population < 7256490011)
       AND area   <  (SELECT ROUND(AVG(area),1)
                        FROM FACTS
                       WHERE population < 7256490011)

Done.

[('Bangladesh',),
 ('Germany',),
 ('Iraq',),
 ('Italy',),
 ('Japan',),
 ('Kenya',),
 ('Korea, South',),
 ('Morocco',),
 ('Philippines',),
 ('Poland',),
 ('Spain',),
 ('Thailand',),
 ('Uganda',),
 ('United Kingdom',),
 ('Vietnam',)]

In [33]:
%%sql 

SELECT name
  FROM facts
 WHERE population < 7000000000
 ORDER BY population DESC
 LIMIT 1;

Done.

[('China',)]

In [20]:
%%sql 

SELECT name
  FROM facts
 WHERE population < 7000000000
 ORDER BY population_growth DESC
 LIMIT 1;

Done.

[('South Sudan',)]

In [35]:
%%sql

SELECT name
  FROM facts
 WHERE population < 7000000000 AND area_water > area_land

Done.

[('Virgin Islands',)]

In [31]:
%%sql


SELECT name, population_growth/100*population AS new_pop
  FROM facts
 WHERE population < 7000000000 
ORDER BY new_pop DESC

 LIMIT 5

Done.

[('India', 15270686.124799998),
 ('China', 6153684.246),
 ('Nigeria', 4448270.372),
 ('Pakistan', 2906653.3662),
 ('Ethiopia', 2874562.1691)]

In [36]:
%%sql

SELECT name
  FROM facts
 WHERE death_rate>birth_rate;

Done.

[('Austria',),
 ('Belarus',),
 ('Bosnia and Herzegovina',),
 ('Bulgaria',),
 ('Croatia',),
 ('Czech Republic',),
 ('Estonia',),
 ('Germany',),
 ('Greece',),
 ('Hungary',),
 ('Italy',),
 ('Japan',),
 ('Latvia',),
 ('Lithuania',),
 ('Moldova',),
 ('Monaco',),
 ('Poland',),
 ('Portugal',),
 ('Romania',),
 ('Russia',),
 ('Serbia',),
 ('Slovenia',),
 ('Ukraine',),
 ('Saint Pierre and Miquelon',)]

In [ ]:
%%sql

SELECT name, population/area AS people